austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
/*
 *
 *  STFL-I based Serial Flash Memory Driver
 *
 *
 *  Filename:		N25Q.c
 *  Description:	Library routines for the N25Q Serial Flash Memories series
 *
 *
 *  Version:		2.1
 *  Date:		    Aug 2015
 *  Authors:		Micron China
 *
 *  THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH
 *  CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A
 *  RESULT, MICRON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL
 *  DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT OF SUCH SOFTWARE
 *  AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN
 *  CONNECTION WITH THEIR PRODUCTS.
 *
 *  Version History
 *
 *  Ver.		Date				Comments
 *
 *  1.0			April 2010			Initial relase
 *  1.1			October 2011		Added 4-byte address mode support for N25Q256
 *  1.2         January 2012    	Minor bug fixing
 *  1.3			February 2012		Added support for N25Q 512M stacked (256M+256M)
 *  1.4			October 2012		Added support for N25Q 8M and 16M
 *  1.5			December 2012		Added support for Step B
 *  1.6			January 2013		Added OTP Program and Read functions
 *  1.7			August 2014	        Fixed single die size bit bug and dieErase timeout bug
 *  1.8			October 2014        add read flag status register for N25Q512Mb/N25Q1Gb device in the IsFlashBusy()
 *	1.9			January 2015		Fixed inconsistent function declaration
 *	2.0			February 2015		Fixed some compilation warnings
 *									Fixed the issue of IsflashBusy() cann't detect correct status
 *									Fixed one potential bug of  FlashWriteNVConfigurationRegister doesn't send the correct value.
 *	2.1			August 2015			added write/read lock register function
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "N25Q.h" 			/* Header file with global prototypes */

/* Serialize.h
 *
 * Serialize.h contains the signature for Serialize_SPI function.
 * This function is platform depended and allows the driver to communicate with flash
 * device. Serialize_SPI has the following signature:
 *
 * SPI_STATUS Serialize_SPI(const CharStream* char_stream_send,
 *              CharStream* char_stream_recv,
 *             SpiConfigOptions optBefore,
 *             SpiConfigOptions optAfter
 *             )
 *
 * where:
 *
 * -	char_stream_send: the char stream to be sent from the SPI master
 * 		to the Flash memory. Usually contains instruction, address, and data
 * 		to be programmed;
 * -	char_stream_recv: the char stream to be received by the SPI master,
 *      sent from the Flash memory. Usually contains data to be read from the
 *      memory;
 * -	optBefore: configurations of the SPI master before any transfer/receive;
 * -	optAfter: configurations of the SPI after any transfer/receive;
 * -	SPI_STATUS can be assume success or failed error value.
 *
 * and in particular optBefore and optAfter can assume the following values:
 *
 * -	OpsWakeUp: set the CS;
 * -	OpsInitTransfer: keep the CS unchanged;
 * -	OpsEndTransfer: clear the CS.
 *
 * This driver assume to use a SPI Flash specific controller who take care about the right
 * signals management for Dual, Quad, Extended mode and dummy bytes insertion. If you
 * use a generic SPI controller, some changes may be necessary.
 *
 */
#include "Serialize.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#ifdef TIME_H_EXISTS
#include <time.h>
#endif

#define UNUSED(x) (void)(x)
#define DEBUG
#define PRINT_FUNCTION_CALL
/* global flash device object */
FLASH_DEVICE_OBJECT *fdo;

/* local function, not api */
void fill_addr_vect(uAddrType udAddr, NMX_uint8* pIns_Addr, NMX_uint8 num_address_byte);
ReturnType WAIT_TILL_Instruction_EXECUTION_COMPLETE(NMX_sint16 second);

/*******************************************************************************
Function:     uAddrType BlockOffset ( uSectorType uscSectorNr);
Arguments:    Sector Number

Description:  This function is used to obtain the sector's start address
Pseudo Code:
   Step 1: Return the sector start address
*******************************************************************************/
uAddrType BlockOffset(uSectorType uscSectorNr)
{
	return (uscSectorNr << fdo->Desc.FlashSectorSize_bit);
}

/*******************************************************************************
Function:     ReturnType Driver_Init(void);
Arguments:

Description:  This function is used to initialize the driver. The function perform
			  device detection and sets driver to use the right functions. If the
			  device is a N25Q256 or higher, the function enables the 4-byte address mode.
Pseudo Code:
   Step 1: Detect the device type
   Step 2: Set device parameters (shape and operation)
   Step 3: If N25Q256 device or higher, call FlashEnter4ByteAddressMode and verify that
		   device accept 4-byte address mode.
*******************************************************************************/
ReturnType Driver_Init(FLASH_DEVICE_OBJECT *flash_device_object)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("Driver_Init\n");
#endif

	
	NMX_uint8 flag = 0;
	NMX_uint32 Device = 0;
	ReturnType ret;
	fdo = flash_device_object;

	ret = FlashReadDeviceIdentification(&Device);
	if(ret == Flash_Success)
	{
		fdo->Desc.FlashId = Device;
	}

	/* N25Q8 */
	if (Device == MEM_TYPE_N25Q8)
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q8\n");
#endif

		/* device shape */
		fdo->Desc.FlashSize = 0x100000;
		fdo->Desc.FlashSectorCount = 0x10;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 0x100;
		fdo->Desc.FlashSubSectorSize = 0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x1000;
		fdo->Desc.FlashPageSize = 0x0100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashAddressMask = 0x00FF;

		/* this device support only 3 byte address mode */
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = NULL_PTR;
		fdo->GenOp.BulkErase = NULL_PTR;
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister  = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = NULL_PTR;
		fdo->GenOp.Exit4ByteAddressMode = NULL_PTR;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

		return Flash_Success;
	}

	/* N25Q16 */
	if (Device == MEM_TYPE_N25Q16)
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q16\n");
#endif

