austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
		/* device shape */
		fdo->Desc.FlashSize = 0x200000;
		fdo->Desc.FlashSectorCount = 0x20;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 0x200;
		fdo->Desc.FlashSubSectorSize = 0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x2000;
		fdo->Desc.FlashPageSize = 0x100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashAddressMask = 0x00FF;

		/* this device support only 3 byte address mode */
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = NULL_PTR;
		fdo->GenOp.BulkErase = NULL_PTR;
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister  = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = NULL_PTR;
		fdo->GenOp.Exit4ByteAddressMode = NULL_PTR;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

		return Flash_Success;
	}


	/* N25Q32 */
	if (Device == MEM_TYPE_N25Q32)
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q32\n");
#endif

		/* device shape */
		fdo->Desc.FlashSize = 0x400000;
		fdo->Desc.FlashSectorCount = 0x40;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 0x400;
		fdo->Desc.FlashSubSectorSize =  0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x4000;
		fdo->Desc.FlashPageSize = 0x100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashAddressMask = 0x00FF;

		/* this device support only 3 byte address mode */
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = NULL_PTR;
		fdo->GenOp.BulkErase = NULL_PTR;
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister  = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = NULL_PTR;
		fdo->GenOp.Exit4ByteAddressMode = NULL_PTR;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

		return Flash_Success;
	}

	/* N25Q64 */
	if (Device == MEM_TYPE_N25Q64)
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q64\n");
#endif

		/* device shape */
		fdo->Desc.FlashSize = 0x800000;
		fdo->Desc.FlashSectorCount = 0x80;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 0x800;
		fdo->Desc.FlashSubSectorSize = 0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x8000;
		fdo->Desc.FlashPageSize = 0x100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashAddressMask = 0x00FF;

		/* this device support only 3 byte address mode */
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = NULL_PTR;
		fdo->GenOp.BulkErase = NULL_PTR;
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister  = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = NULL_PTR;
		fdo->GenOp.Exit4ByteAddressMode = NULL_PTR;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

		return Flash_Success;
	}

