austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
	/* N25Q128 */
	if (Device == MEM_TYPE_N25Q128)
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q128\n");
#endif

		/* device shape */
		fdo->Desc.FlashSize = 0x1000000;
		fdo->Desc.FlashSectorCount = 0x100;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 0x1000;
		fdo->Desc.FlashSubSectorSize = 0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x10000;
		fdo->Desc.FlashPageSize = 0x100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashAddressMask = 0x00FF;

		/* this device support only 3 byte address mode */
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = NULL_PTR;
		fdo->GenOp.BulkErase = NULL_PTR;
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister  = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = NULL_PTR;
		fdo->GenOp.Exit4ByteAddressMode = NULL_PTR;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

		return Flash_Success;
	}

	/* N25Q256 */
	if (Device == MEM_TYPE_N25Q256)
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q256\n");
#endif

		/* device shape */
		fdo->Desc.FlashSize = 0x2000000;
		fdo->Desc.FlashSectorCount = 0x200;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 0x2000;
		fdo->Desc.FlashSubSectorSize = 0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x20000;
		fdo->Desc.FlashPageSize = 0x100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashAddressMask = 0x00FF;

		/* 3-addr-byte is default startup address mode, except if you use
		 * NVConfig addr mode setting (please see datasheet for more details)
		 */
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = NULL_PTR;
#ifdef SUPPORT_N25Q_STEP_B
		fdo->GenOp.BulkErase = FlashBulkErase;
#endif
#ifndef SUPPORT_N25Q_STEP_B
		fdo->GenOp.BulkErase = NULL_PTR;
#endif
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = FlashEnter4ByteAddressMode;
		fdo->GenOp.Exit4ByteAddressMode = FlashExit4ByteAddressMode;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

#ifdef ADDR_MODE_AUTO_DETECT
		/* assume you want to use the whole device size  */
		fdo->GenOp.Enter4ByteAddressMode();
		/* verify current addr mode */
		fdo->GenOp.ReadFlagStatusRegister(&flag);
		if (flag & 1)   /* test addressing bit of flag status reg (bit 0) */
			fdo->Desc.NumAddrByte = FLASH_4_BYTE_ADDR_MODE;
#endif

		return Flash_Success;
	}

	/* N25Q512 */
	if ((Device == MEM_TYPE_N25Q512_V3) || (Device == MEM_TYPE_N25Q512_V18))
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q512\n");
#endif

		/* device shape */
		fdo->Desc.FlashSize = 0x4000000;
		fdo->Desc.FlashSectorCount = 0x400;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 10000;
		fdo->Desc.FlashSubSectorSize = 0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x40000;
		fdo->Desc.FlashPageSize = 0x100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashDieCount = 2;
		fdo->Desc.FlashDieSize = 0x2000000;
		fdo->Desc.FlashDieSize_bit = 25;
		fdo->Desc.FlashAddressMask = 0x00FF;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = FlashDieErase;
		fdo->GenOp.BulkErase = NULL_PTR;
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = FlashEnter4ByteAddressMode;
		fdo->GenOp.Exit4ByteAddressMode = FlashExit4ByteAddressMode;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

