austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
#ifdef ADDR_MODE_AUTO_DETECT
		/* assume you want to use the whole device size  */
		fdo->GenOp.Enter4ByteAddressMode();
		/* verify current addr mode */
		fdo->GenOp.ReadFlagStatusRegister(&flag);
		if (flag & 1)   /* test addressing bit of flag status reg (bit 0) */
			fdo->Desc.NumAddrByte = FLASH_4_BYTE_ADDR_MODE;
#endif

		return Flash_Success;
	}

	/* N25Q1G (512M+512m stacked) */
	if (Device == MEM_TYPE_N25Q1G)
	{
#ifdef DEBUG
		NRF_LOG_RAW_INFO("Detected N25Q1G\n");
#endif

		/* device shape */
		fdo->Desc.FlashSize = 0x8000000;
		fdo->Desc.FlashSectorCount = 0x800;
		fdo->Desc.FlashSectorSize = 0x10000;
		fdo->Desc.FlashSectorSize_bit = 16;
		fdo->Desc.FlashSubSectorCount = 0x8000;
		fdo->Desc.FlashSubSectorSize = 0x1000;
		fdo->Desc.FlashSubSectorSize_bit = 12;
		fdo->Desc.FlashPageCount = 0x80000;
		fdo->Desc.FlashPageSize = 0x100;
		fdo->Desc.FlashOTPSize = 0x40;
		fdo->Desc.FlashAddressMask = 0x00FF;
		fdo->Desc.FlashDieCount = 4;
		fdo->Desc.FlashDieSize = 0x2000000;
		fdo->Desc.FlashDieSize_bit = 25;
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

		/* device operation */
		fdo->GenOp.DeviceId = FlashReadDeviceIdentification;
		fdo->GenOp.ReadStatusRegister = FlashReadStatusRegister;
		fdo->GenOp.DataProgram = DataProgram;
		fdo->GenOp.DataRead = DataRead;
		fdo->GenOp.SectorErase = FlashSectorErase;
		fdo->GenOp.SubSectorErase = FlashSubSectorErase;
		fdo->GenOp.DieErase = FlashDieErase;
		fdo->GenOp.BulkErase = NULL_PTR;
		fdo->GenOp.BlockOffset = BlockOffset;
		fdo->GenOp.WriteEnable = FlashWriteEnable;
		fdo->GenOp.WriteDisable = FlashWriteDisable;
		fdo->GenOp.ProgramEraseSuspend = NULL_PTR;
		fdo->GenOp.ProgramEraseResume = NULL_PTR;
		fdo->GenOp.ClearFlagStatusRegister = FlashClearFlagStatusRegister;
		fdo->GenOp.ReadNVConfigurationRegister = FlashReadNVConfigurationRegister;
		fdo->GenOp.ReadVolatileConfigurationRegister = FlashReadVolatileConfigurationRegister;
		fdo->GenOp.ReadVolatileEnhancedConfigurationRegister = FlashReadVolatileEnhancedConfigurationRegister;
		fdo->GenOp.ReadFlagStatusRegister = FlashReadFlagStatusRegister;
		fdo->GenOp.WriteNVConfigurationRegister = FlashWriteNVConfigurationRegister;
		fdo->GenOp.WriteVolatileConfigurationRegister = FlashWriteVolatileConfigurationRegister;
		fdo->GenOp.WriteVolatileEnhancedConfigurationRegister = FlashWriteVolatileEnhancedConfigurationRegister;
		fdo->GenOp.Enter4ByteAddressMode = FlashEnter4ByteAddressMode;
		fdo->GenOp.Exit4ByteAddressMode = FlashExit4ByteAddressMode;
		fdo->GenOp.LockSector = FlashLockSector;
		fdo->GenOp.UnlockAllSector = FlashUnlockAllSector;
		fdo->GenOp.OTPProgram = FlashOTPProgram;
		fdo->GenOp.OTPRead = FlashOTPRead;

#ifdef ADDR_MODE_AUTO_DETECT
		/* assume you want to use the whole device size  */
		fdo->GenOp.Enter4ByteAddressMode();
		/* verify current addr mode */
		fdo->GenOp.ReadFlagStatusRegister(&flag);
		if (flag & 1)   /* test addressing bit of flag status reg (bit 0) */
			fdo->Desc.NumAddrByte = FLASH_4_BYTE_ADDR_MODE;
#endif

		return Flash_Success;
	}

#ifdef DEBUG
	NRF_LOG_RAW_INFO("No device detected %x\n",Device);
#endif

	return Flash_WrongType;
}

/*******************************************************************************
Function:     ReturnType Program(InstructionType insInstruction, ParameterType *fp )
Arguments:    insInstruction is an enum which contains all the available Instructions
    of the SW driver.
              fp is a (union) parameter struct for all Flash Instruction parameters
Return Value: The function returns the following conditions:

   Flash_AddressInvalid,
   Flash_MemoryOverflow,
   Flash_PageEraseFailed,
   Flash_PageNrInvalid,
   Flash_SectorNrInvalid,
   Flash_FunctionNotSupported,
   Flash_NoInformationAvailable,
   Flash_OperationOngoing,
   Flash_OperationTimeOut,
   Flash_ProgramFailed,
   Flash_SpecificError,
   Flash_SectorProtected,
   Flash_SectorUnprotected,
   Flash_SectorProtectFailed,
   Flash_SectorUnprotectFailed,
   Flash_SectorLocked,
   Flash_SectorUnlocked,
   Flash_SectorLockDownFailed,
   Flash_Success,
   Flash_WrongType

Description:  This function is used to access all functions provided with the
   current Flash device.

Pseudo Code:
   Step 1: Select the right action using the insInstruction parameter
   Step 2: Execute the Flash memory Function
   Step 3: Return the Error Code
*******************************************************************************/
ReturnType DataProgram(InstructionType insInstruction, ParameterType *fp)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("DataProgram\n");
#endif	
	
	ReturnType rRetVal;
	NMX_uint8 insCode;

	switch (insInstruction)
	{

	/* PAGE PROGRAM */
	case PageProgram:
#ifndef SUPPORT_N25Q_STEP_B
		insCode = SPI_FLASH_INS_PP;
#endif
#ifdef SUPPORT_N25Q_STEP_B
		insCode = SPI_FLASH_INS_PP4B;
#endif
		break;

	/* DUAL INPUT FAST PROGRAM */
	case DualInputProgram:
		insCode = SPI_FLASH_INS_DIPP;
		break;

	/* EXTENDED DUAL INPUT FAST PROGRAM */
	case DualInputExtendedFastProgram:
		insCode = SPI_FLASH_INS_DIEPP;
		break;

	/* QUAD INPUT FAST PROGRAM */
	case QuadInputProgram:
#ifndef SUPPORT_N25Q_STEP_B
		insCode = SPI_FLASH_INS_QIPP;
#endif
#ifdef SUPPORT_N25Q_STEP_B
		insCode = SPI_FLASH_INS_QIPP4B;
#endif
		break;

	/* EXTENDED QUAD INPUT FAST PROGRAM */
	case QuadInputExtendedFastProgram:
		insCode = SPI_FLASH_INS_QIEPP;
		break;

	default:
		return Flash_FunctionNotSupported;
		//break;

	} /* EndSwitch */

	rRetVal = FlashDataProgram( (*fp).PageProgram.udAddr,
	                            (*fp).PageProgram.pArray,
	                            (*fp).PageProgram.udNrOfElementsInArray,
	                            insCode
	                          );

	return rRetVal;
} /* EndFunction Flash */


/*******************************************************************************
Function:     ReturnType DataRead(InstructionType insInstruction, ParameterType *fp)
Arguments:    insInstruction is an enum which contains all the available Instructions
    of the SW driver.
              fp is a (union) parameter struct for all Flash Instruction parameters
Return Value: The function returns the following conditions:

