austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
   Flash_AddressInvalid,
   Flash_MemoryOverflow,
   Flash_PageEraseFailed,
   Flash_PageNrInvalid,
   Flash_SectorNrInvalid,
   Flash_FunctionNotSupported,
   Flash_NoInformationAvailable,
   Flash_OperationOngoing,
   Flash_OperationTimeOut,
   Flash_ProgramFailed,
   Flash_SpecificError,
   Flash_SectorProtected,
   Flash_SectorUnprotected,
   Flash_SectorProtectFailed,
   Flash_SectorUnprotectFailed,
   Flash_SectorLocked,
   Flash_SectorUnlocked,
   Flash_SectorLockDownFailed,
   Flash_Success,
   Flash_WrongType

Description:  This function is used to access all functions provided with the
   current Flash device.

Pseudo Code:
   Step 1: Select the right action using the insInstruction parameter
   Step 2: Execute the Flash memory Function
   Step 3: Return the Error Code
*******************************************************************************/
ReturnType DataRead(InstructionType insInstruction, ParameterType *fp)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("DataRead\n");
#endif	
	
	NMX_uint8 insCode;
	ReturnType rRetVal;

	switch (insInstruction)
	{
	case Read:
		insCode = SPI_FLASH_INS_READ;
		break;

	case FastRead:
		insCode = SPI_FLASH_INS_FAST_READ;
		break;

	case DualOutputFastRead:
		insCode = SPI_FLASH_INS_DOFR;
		break;

	case QuadOutputFastRead:
		insCode = SPI_FLASH_INS_QOFR;
		break;

	case DualInputOutputFastRead:
		insCode = SPI_FLASH_INS_DIOFR;
		break;

	case QuadInputOutputFastRead:
		insCode = SPI_FLASH_INS_QIOFR;
		break;
	case ReadFlashDiscovery:
		insCode = SPI_FLASH_INS_DISCOVER_PARAMETER;
		break;

	default:
		return Flash_FunctionNotSupported;
		//break;

	} /* EndSwitch */
	rRetVal = FlashDataRead(fp->Read.udAddr, fp->Read.pArray, fp->Read.udNrOfElementsToRead, insCode);
	return rRetVal;
}


/*******************************************************************************
Function:     FlashWriteEnable( void )
Arguments:    void

Return Value:
   Flash_Success

Description:  This function sets the Write Enable Latch(WEL)
              by sending a WREN Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially
*******************************************************************************/
ReturnType FlashWriteEnable( void )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashWriteEnable\n");
#endif

	CharStream char_stream_send;
	NMX_uint8 cWREN = SPI_FLASH_INS_WREN;
	NMX_uint8 ucSR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length = 1;
	char_stream_send.pChar  = &cWREN;

	// Step 2: Send the packet serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 3: Read the Status Register.
	do
	{
		FlashReadStatusRegister(&ucSR);
	}
	while(~ucSR & SPI_SR1_WEL);

	return Flash_Success;
}

/*******************************************************************************
Function:     FlashWriteDisable( void )
Arguments:    void

Return Value:
   Flash_Success

Description:  This function resets the Write Enable Latch(WEL)
              by sending a WRDI Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially
*******************************************************************************/
ReturnType  FlashWriteDisable( void )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashWriteDisable\n");
#endif

	CharStream char_stream_send;
	NMX_uint8 cWRDI = SPI_FLASH_INS_WRDI;
	NMX_uint8 ucSR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length = 1;
	char_stream_send.pChar  = &cWRDI;

	// Step 2: Send the packet serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 3: Read the Status Register.
	do
	{
		FlashReadStatusRegister(&ucSR);
	}
	while(ucSR & SPI_SR1_WEL);

	return Flash_Success;
}

/*******************************************************************************
Function:     FlashReadDeviceIdentification( NMX_uint32 *uwpDeviceIdentification)
Arguments:    uwpDeviceIdentificaiton, 32-bit buffer to hold the DeviceIdentification
			  read from the memory, with this parts:

NMX_unit32

 | 0x00 | MANUFACTURER_ID | MEM_TYPE | MEM_CAPACITY |
MSB                                                LSB

Return Value:
   Flash_Success

Description:  This function returns the Device Identification
			  (manufacurer id + memory type + memory capacity)
              by sending an SPI_FLASH_INS_RDID Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially
   Step 3: Device Identification is returned
*******************************************************************************/
ReturnType FlashReadDeviceIdentification(NMX_uint32 *uwpDeviceIdentification)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashReadDeviceIdentification\n");
#endif	
	
	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  cRDID = SPI_FLASH_INS_RDID;
	NMX_uint8  pIdentification[4];
	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length  = 1;
	char_stream_send.pChar   = &cRDID;

	char_stream_recv.length  = 3;
	char_stream_recv.pChar   = &pIdentification[0];

	// Step 2: Send the packet serially
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

#ifdef DEBUG
	NRF_LOG_RAW_INFO("DeviceId[0] = 0x%x\n", char_stream_recv.pChar[0]);
	NRF_LOG_RAW_INFO("DeviceId[1] = 0x%x\n", char_stream_recv.pChar[1]);
	NRF_LOG_RAW_INFO("DeviceId[2] = 0x%x\n", char_stream_recv.pChar[2]);
	NRF_LOG_FLUSH();
#endif

	// Step 3: Device Identification is returned ( manufaturer id + memory type + memory capacity )
	*uwpDeviceIdentification = char_stream_recv.pChar[0];
	*uwpDeviceIdentification <<= 8;
	*uwpDeviceIdentification |= char_stream_recv.pChar[1];
	*uwpDeviceIdentification <<= 8;
	*uwpDeviceIdentification |= char_stream_recv.pChar[2];

	return Flash_Success;
}

