austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
/*******************************************************************************
Function:     FlashReadStatusRegister( NMX_uint8 *ucpStatusRegister)    ----ok
Arguments:    ucpStatusRegister, 8-bit buffer to hold the Status Register value read
              from the memory

Return Value:
   Flash_Success

Description:  This function reads the Status Register by sending an
               SPI_FLASH_INS_RDSR Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially, get the Status Register content

*******************************************************************************/
ReturnType FlashReadStatusRegister(NMX_uint8 *ucpStatusRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashReadStatusRegister\n");
#endif

	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  cRDSR = SPI_FLASH_INS_RDSR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length  = 1;
	char_stream_send.pChar   = &cRDSR;
	char_stream_recv.length  = 1;
	char_stream_recv.pChar   = &ucpStatusRegister[0];

	// Step 2: Send the packet serially, get the Status Register content
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}


/*******************************************************************************
Function:     FlashWriteStatusRegister( NMX_uint8 ucStatusRegister)
Arguments:    ucStatusRegister, an 8-bit new value to be written to the Status Register

Return Value:
   Flash_Success

Description:  This function modifies the Status Register by sending an
              SPI_FLASH_INS_WRSR Instruction.
              The Write Status Register (WRSR) Instruction has no effect
              on b6, b5, b1(WEL) and b0(WIP) of the Status Register.b6 and b5 are
              always read as 0.

Pseudo Code:
   Step 1: Disable Write protection
   Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
   Step 3: Send the packet serially
   Step 4: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType  FlashWriteStatusRegister(NMX_uint8 ucStatusRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashWriteStatusRegister\n");
#endif	
	
	CharStream char_stream_send;
	NMX_uint8  pIns_Val[2];

	// Step 1: Disable Write protection
	fdo->GenOp.WriteEnable();

	// Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
	char_stream_send.length = 2;
	char_stream_send.pChar  = pIns_Val;
	pIns_Val[0] = SPI_FLASH_INS_WRSR;
	pIns_Val[1] = ucStatusRegister;

	// Step 3: Send the packet serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 4: Wait until the operation completes or a timeout occurs.
	return WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);
}


/*******************************************************************************
Function:     FlashRead( NMX_uint32 udAddr, NMX_uint8 *ucpElements, NMX_uint32 udNrOfElementsToRead)
Arguments:    udAddr, start address to read from
              ucpElements, buffer to hold the elements to be returned
              udNrOfElementsToRead, number of elements to be returned, counted in bytes.

Return Value:
   Flash_AddressInvalid
   Flash_Success

Description:  This function reads the Flash memory by sending an
              SPI_FLASH_INS_READ Instruction.
              by design, the whole Flash memory space can be read with one READ Instruction
              by incrementing the start address and rolling to 0x0 automatically,
              that is, this function is across pages and sectors.

Pseudo Code:
   Step 1: Validate address input
   Step 2: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 3: Send the packet serially, and fill the buffer with the data being returned
*******************************************************************************/
ReturnType FlashDataRead( uAddrType udAddr, NMX_uint8 *ucpElements, NMX_uint32 udNrOfElementsToRead, NMX_uint8 insInstruction)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashDataRead\n");
#endif	
	
	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  pIns_Addr[5];

	// Step 1: Validate address input
	if(!(udAddr < fdo->Desc.FlashSize))
		return Flash_AddressInvalid;

	// Step 2: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;
	char_stream_send.pChar    = pIns_Addr;
	pIns_Addr[0]              = insInstruction;

	fill_addr_vect(udAddr, pIns_Addr, fdo->Desc.NumAddrByte);

	char_stream_recv.length   = udNrOfElementsToRead;
	char_stream_recv.pChar    = ucpElements;

	// Step 3: Send the packet serially, and fill the buffer with the data being returned
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}

/*******************************************************************************
Function:     FlashPageProgram( NMX_uint32 udAddr, NMX_uint8 *pArray, NMX_uint32 udNrOfElementsInArray)
Arguments:    udAddr, start address to write to
              pArray, buffer to hold the elements to be programmed
              udNrOfElementsInArray, number of elements to be programmed, counted in bytes

Return Value:
   Flash_AddressInvalid
   Flash_OperationOngoing
   Flash_OperationTimeOut
   Flash_Success

Description:  This function writes a maximum of 64 bytes of data into the memory by sending an
              SPI_FLASH_INS_PP Instruction.
              by design, the PP Instruction is effective WITHIN ONE page,i.e. 0xXX00 - 0xXXff.
              when 0xXXff is reached, the address rolls over to 0xXX00 automatically.
Note:
              This function does not check whether the target memory area is in a Software
              Protection Mode(SPM) or Hardware Protection Mode(HPM), in which case the PP
              Instruction will be ignored.
              The function assumes that the target memory area has previously been unprotected at both
              the hardware and software levels.
              To unprotect the memory, please call FlashWriteStatusRegister(NMX_uint8 ucStatusRegister),
              and refer to the datasheet for the setup of a proper ucStatusRegister value.
Pseudo Code:
   Step 1: Validate address input
   Step 2: Check whether any previous Write, Program or Erase cycle is on going
   Step 3: Disable Write protection (the Flash memory will automatically enable it again after
           the execution of the Instruction)
   Step 4: Initialize the data (Instruction & address only) packet to be sent serially
   Step 5: Send the packet (Instruction & address only) serially
   Step 6: Initialize the data (data to be programmed) packet to be sent serially
   Step 7: Send the packet (data to be programmed) serially
   Step 8: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType FlashGenProgram(uAddrType udAddr, NMX_uint8 *pArray , NMX_uint32 udNrOfElementsInArray, NMX_uint8 ubSpiInstruction)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashGenProgram\n");
#endif	

	CharStream char_stream_send;
	NMX_uint8 pIns_Addr[5];
	NMX_uint8 fsr_value;
	ReturnType ret;

	// Step 1: Validate address input
	if(!(udAddr < fdo->Desc.FlashSize))
		return Flash_AddressInvalid;

	// Step 2: Check whether any previous Write, Program or Erase cycle is on-going
	if(IsFlashBusy()) return Flash_OperationOngoing;

	// Step 3: Disable Write protection
	fdo->GenOp.WriteEnable();

	// Step 4: Initialize the data (Instruction & address only) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;
	char_stream_send.pChar    = pIns_Addr;

