austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
	pIns_Addr[0]              = ubSpiInstruction;

	fill_addr_vect(udAddr, pIns_Addr, fdo->Desc.NumAddrByte);

	// Step 5: Send the packet (Instruction & address only) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsInitTransfer);

	// Step 6: Initialize the data (data to be programmed) packet to be sent serially
	char_stream_send.length   = udNrOfElementsInArray;
	char_stream_send.pChar    = pArray;

	// Step 7: Send the packet (data to be programmed) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 8: Wait until the operation completes or a timeout occurs.
	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);


	FlashReadFlagStatusRegister(&fsr_value);
	FlashClearFlagStatusRegister();

	if((fsr_value & SPI_FSR_PROT) && (fsr_value & SPI_FSR_PROGRAM))
		return Flash_SectorProtected;

	return ret;

}


/*******************************************************************************
Function:     ReturnType FlashSectorErase( uSectorType uscSectorNr )
Arguments:    uSectorType is the number of the Sector to be erased.

Return Values:
   Flash_SectorNrInvalid
   Flash_OperationOngoing
   Flash_OperationTimeOut
   Flash_Success

Description:  This function erases the Sector specified in uscSectorNr by sending an
              SPI_FLASH_INS_SE Instruction.
              The function checks that the sector number is within the valid range
              before issuing the erase Instruction. Once erase has completed the status
              Flash_Success is returned.
Note:
              This function does not check whether the target memory area is in a Software
              Protection Mode(SPM) or Hardware Protection Mode(HPM), in which case the PP
              Instruction will be ignored.
              The function assumes that the target memory area has previously been unprotected at both
              the hardware and software levels.
              To unprotect the memory, please call FlashWriteStatusRegister(NMX_uint8 ucStatusRegister),
              and refer to the datasheet to set a proper ucStatusRegister value.

Pseudo Code:
   Step 1: Validate the sector number input
   Step 2: Check whether any previous Write, Program or Erase cycle is on going
   Step 3: Disable Write protection (the Flash memory will automatically enable it
           again after the execution of the Instruction)
   Step 4: Initialize the data (Instruction & address) packet to be sent serially
   Step 5: Send the packet (Instruction & address) serially
   Step 6: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType  FlashSectorErase( uSectorType uscSectorNr )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashSectorErase\n");
#endif	

	CharStream char_stream_send;
	//NMX_uint8  pIns_Addr[4];
	NMX_uint8  pIns_Addr[5];
	uAddrType SectorAddr;
	NMX_uint8 fsr_value;
	ReturnType ret;
	UNUSED(ret);
	
	// Step 1: Validate the sector number input
	if(!(uscSectorNr < fdo->Desc.FlashSectorCount)) return Flash_SectorNrInvalid;

	SectorAddr = fdo->GenOp.BlockOffset(uscSectorNr);

	// Step 2: Check whether any previous Write, Program or Erase cycle is on going
	if(IsFlashBusy()) return Flash_OperationOngoing;

	// Step 3: Disable Write protection
	fdo->GenOp.WriteEnable();

	// Step 4: Initialize the data (Instruction & address) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;
	char_stream_send.pChar    = &pIns_Addr[0];

#ifndef SUPPORT_N25Q_STEP_B
	pIns_Addr[0]              = SPI_FLASH_INS_SE;
#endif
#ifdef SUPPORT_N25Q_STEP_B
	pIns_Addr[0]              = SPI_FLASH_INS_SE4B;
#endif

	fill_addr_vect(SectorAddr, pIns_Addr, fdo->Desc.NumAddrByte);

	// Step 5: Send the packet (Instruction & address) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 6: Wait until the operation completes or a timeout occurs.
	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(SE_TIMEOUT);

	FlashReadFlagStatusRegister(&fsr_value);
	FlashClearFlagStatusRegister();

	if((fsr_value & SPI_FSR_PROT) && (fsr_value & SPI_FSR_ERASE))
		return Flash_SectorProtected;

	return Flash_Success;
}


/*******************************************************************************
Function:     ReturnType FlashSunSectorErase( uSectorType uscSectorNr )
Arguments:    uSectorType is the number of the subSector to be erased.

Return Values:
   Flash_SectorNrInvalid
   Flash_OperationOngoing
   Flash_OperationTimeOut
   Flash_Success

Description:  This function erases the SubSector (4k) specified in uscSectorNr by sending an
              SPI_FLASH_INS_SSE Instruction.
              The function checks that the sub sector number is within the valid range
              before issuing the erase Instruction. Once erase has completed the status
              Flash_Success is returned.
Note:
              This function does not check whether the target memory area is in a Software
              Protection Mode(SPM) or Hardware Protection Mode(HPM), in which case the PP
              Instruction will be ignored.
              The function assumes that the target memory area has previously been unprotected at both
              the hardware and software levels.
              To unprotect the memory, please call FlashWriteStatusRegister(NMX_uint8 ucStatusRegister),
              and refer to the datasheet to set a proper ucStatusRegister value.

Pseudo Code:
   Step 1: Validate the sub sector number input
   Step 2: Check whether any previous Write, Program or Erase cycle is on going
   Step 3: Disable Write protection (the Flash memory will automatically enable it
           again after the execution of the Instruction)
   Step 4: Initialize the data (Instruction & address) packet to be sent serially
   Step 5: Send the packet (Instruction & address) serially
   Step 6: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType  FlashSubSectorErase( uSectorType uscSectorNr )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashSubSectorErase\n");
#endif		
	
	CharStream char_stream_send;
	NMX_uint8  pIns_Addr[5];
	uAddrType SubSectorAddr;
	NMX_uint8 fsr_value;
	ReturnType ret;
	UNUSED(ret);
	
