austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
	// Step 1: Validate the sector number input
	if(!(uscSectorNr < fdo->Desc.FlashSubSectorCount))
		return Flash_SectorNrInvalid;

	SubSectorAddr = uscSectorNr << fdo->Desc.FlashSubSectorSize_bit;

	// Step 2: Check whether any previous Write, Program or Erase cycle is on going
	if(IsFlashBusy()) return Flash_OperationOngoing;

	// Step 3: Disable Write protection
	fdo->GenOp.WriteEnable();

	// Step 4: Initialize the data (Instruction & address) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;;
	char_stream_send.pChar    = &pIns_Addr[0];

#ifndef SUPPORT_N25Q_STEP_B
	pIns_Addr[0]              = SPI_FLASH_INS_SSE;
#endif
#ifdef SUPPORT_N25Q_STEP_B
	pIns_Addr[0]              = SPI_FLASH_INS_SSE4B;
#endif

	fill_addr_vect(SubSectorAddr, pIns_Addr, fdo->Desc.NumAddrByte);

	// Step 5: Send the packet (Instruction & address) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 6: Wait until the operation completes or a timeout occurs.
	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(SE_TIMEOUT);

	FlashReadFlagStatusRegister(&fsr_value);
	FlashClearFlagStatusRegister();

	if((fsr_value & SPI_FSR_PROT) && (fsr_value & SPI_FSR_ERASE))
		return Flash_SectorProtected;

	return Flash_Success;
}


/*******************************************************************************
Function: FlashDieErase

Arguments: uscDieNr

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType  FlashDieErase( uSectorType uscDieNr )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashDieErase\n");
#endif	

	CharStream char_stream_send;
	NMX_uint8  pIns_Addr[5];
	uAddrType DieAddr;
	NMX_uint8 fsr_value;
	ReturnType ret;
	UNUSED(ret);
	
	// Step 1: Validate the sector number input
	if(!(uscDieNr < fdo->Desc.FlashDieCount))
		return Flash_SectorNrInvalid;

	DieAddr = uscDieNr << fdo->Desc.FlashDieSize_bit;

	// Step 2: Check whether any previous Write, Program or Erase cycle is on going
	if(IsFlashBusy()) return Flash_OperationOngoing;

	// Step 3: Disable Write protection
	fdo->GenOp.WriteEnable();

	// Step 4: Initialize the data (Instruction & address) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;;
	char_stream_send.pChar    = &pIns_Addr[0];
	pIns_Addr[0]              = SPI_FLASH_INS_DE;
	fill_addr_vect(DieAddr, pIns_Addr, fdo->Desc.NumAddrByte);

	// Step 5: Send the packet (Instruction & address) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 6: Wait until the operation completes or a timeout occurs.
	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(DIE_TIMEOUT);

	FlashReadFlagStatusRegister(&fsr_value);
	FlashClearFlagStatusRegister();

	if((fsr_value & SPI_FSR_PROT) && (fsr_value & SPI_FSR_ERASE))
		return Flash_SectorProtected;

	return Flash_Success;
}

/*******************************************************************************
Function:     ReturnType FlashBulkErase( void )
Arguments:    none

Return Values:
   Flash_OperationOngoing
   Flash_OperationTimeOut
   Flash_Success

Description:  This function erases the whole Flash memory by sending an
              SPI_FLASH_INS_BE Instruction.
Note:
			  (Only for N25QxxxA8 devices)

              This function does not check whether the target memory area (or part of it)
			  is in a Software Protection Mode(SPM) or Hardware Protection Mode(HPM),
			  in which case the PP Instruction will be ignored.
              The function assumes that the target memory area has previously been unprotected at both
              the hardware and software levels.
              To unprotect the memory, please call FlashWriteStatusRegister(NMX_uint8 ucStatusRegister),
              and refer to the datasheet to set a proper ucStatusRegister value.

Pseudo Code:
   Step 1: Check whether any previous Write, Program or Erase cycle is on going
   Step 2: Disable the Write protection (the Flash memory will automatically enable it
           again after the execution of the Instruction)
   Step 3: Initialize the data (Instruction & address) packet to be sent serially
   Step 4: Send the packet (Instruction & address) serially
   Step 5: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
#ifdef SUPPORT_N25Q_STEP_B
ReturnType FlashBulkErase( void )
{
	#ifdef PRINT_FUNCTION_CALL
		NRF_LOG_RAW_INFO("FlashBulkErase\n");
	#endif	

	CharStream char_stream_send;
	NMX_uint8  cBE = SPI_FLASH_INS_BE;
	NMX_uint8 fsr_value;
	ReturnType ret;

	// Step 1: Check whether any previous Write, Program or Erase cycle is on going
	if(IsFlashBusy()) return Flash_OperationOngoing;

	// Step 2: Disable Write protection
	fdo->GenOp.WriteEnable();

	// Step 3: Initialize the data(Instruction & address) packet to be sent serially
	char_stream_send.length   = 1;
	char_stream_send.pChar    = &cBE;

	// Step 4: Send the packet(Instruction & address) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 5: Wait until the operation completes or a timeout occurs.
	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(BE_TIMEOUT);

	FlashReadFlagStatusRegister(&fsr_value);
	FlashClearFlagStatusRegister();

	if((fsr_value & SPI_FSR_PROT) && (fsr_value & SPI_FSR_ERASE))
		return Flash_SectorProtected;

	return ret;
}
#endif

/*******************************************************************************
Function:     IsFlashBusy(void)
Arguments:    none

Return Value:
   TRUE
   FALSE

Description:  This function checks the Write In Progress (WIP) bit to determine whether
              the Flash memory is busy with a Write, Program or Erase cycle.

Pseudo Code:
   Step 1: Read the Status Register/Flag Status Register.
   Step 2: Check if busy.
*******************************************************************************/
BOOL IsFlashBusy(void)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("IsFlashBusy\n");
#endif	
	
	NMX_uint8 ucSR;
	NMX_uint8 CheckBit;

