austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
	// Step 1: Read the Status Register.
	if((fdo->Desc.FlashId == MEM_TYPE_N25Q512_V3) || (fdo->Desc.FlashId == MEM_TYPE_N25Q1G) || (fdo->Desc.FlashId == MEM_TYPE_N25Q512_V18))
	{
		FlashReadFlagStatusRegister(&ucSR);
		CheckBit = SPI_FSR_PROG_ERASE_CTL;
		if( !(ucSR & CheckBit))//for this,please refer to N25Q256/N25Q00 datasheet.
			return TRUE;
	}
	else
	{
		FlashReadStatusRegister(&ucSR);
		CheckBit = SPI_FLASH_WIP;
		if(ucSR & CheckBit)
			return TRUE;
	}
	return FALSE;
}

/*******************************************************************************
Function:     IsFlashWELBusy( )
Arguments:    none

Return Value:
   TRUE
   FALSE

Description:  This function checks the Write Enable bit to determine whether
              the Flash memory is busy with a Write Enable or Write Disable Op.

Pseudo Code:
   Step 1: Read the Status Register.
   Step 2: Check the WEL bit.
*******************************************************************************/
BOOL IsFlashWELBusy(void)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("IsFlashWELBusy\n");
#endif		
	
	NMX_uint8 ucSR;

	// Step 1: Read the Status Register.
	FlashReadStatusRegister(&ucSR);

	// Step 2: Check the WEL bit.
	if(ucSR & SPI_FLASH_WEL)
		return TRUE;
	else
		return FALSE;
}

/*******************************************************************************
Function:     	FlashDataProgram( )
*******************************************************************************/
ReturnType FlashDataProgram(uAddrType udAddr, NMX_uint8 *pArray , NMX_uint16 udNrOfElementsInArray, NMX_uint8 ubSpiInstruction)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashDataProgram\n");
#endif		
	
	ReturnType retValue = Flash_Success;
	NMX_uint16 dataOffset;

	// Enabling the Write
	fdo->GenOp.WriteEnable();

	if (retValue != Flash_Success)
		return retValue;

	// Computing the starting alignment, i.e. the distance from the 64 bytes boundary
	dataOffset = (fdo->Desc.FlashPageSize - (udAddr & fdo->Desc.FlashAddressMask) ) & fdo->Desc.FlashAddressMask;
	if (dataOffset > udNrOfElementsInArray)
		dataOffset = udNrOfElementsInArray;
	if (dataOffset > 0)
	{
		retValue = FlashGenProgram(udAddr, pArray, dataOffset, ubSpiInstruction);
		if (Flash_Success != retValue)
			return retValue;
	}

	for ( ; (dataOffset+fdo->Desc.FlashPageSize) < udNrOfElementsInArray; dataOffset += fdo->Desc.FlashPageSize)
	{
		retValue = FlashGenProgram(udAddr+dataOffset, pArray+dataOffset, fdo->Desc.FlashPageSize, ubSpiInstruction);
		if (Flash_Success != retValue)
			return retValue;
	}

	if (udNrOfElementsInArray > dataOffset)
		retValue = FlashGenProgram(udAddr+dataOffset, pArray+dataOffset, (udNrOfElementsInArray-dataOffset), ubSpiInstruction);

	return retValue;
}

/*******************************************************************************
Function:     ReturnType FlashProgramEraseResume( void )
Arguments:    none

Return Values:
   Flash_Success

Description:  This function resumes the program/erase operation suspended by sending an
              SPI_FLASH_INS_PER Instruction.
Note:

Pseudo Code:
   Step 1: Check whether any previous Write, Program or Erase cycle is suspended
   Step 2: Initialize the data (Instruction & address) packet to be sent serially
   Step 3: Send the packet (Instruction & address) serially
 ******************************************************************************/
ReturnType  FlashProgramEraseResume( void )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashProgramEraseResume\n");
#endif		
	
	/* not implemented */
	return Flash_FunctionNotSupported;
}

/*******************************************************************************
Function:     ReturnType FlashProgramEraseSuspend( void )
Arguments:    none

Return Values:
   Flash_Success

Description:  This function resumes the program/erase operation suspended by sending an
              SPI_FLASH_INS_PES Instruction.
Note:

Pseudo Code:
   Step 1: Initialize the data (Instruction) packet to be sent serially
   Step 2: Send the packet (Instruction) serially
 ******************************************************************************/
ReturnType  FlashProgramEraseSuspend( void )
{
	/* not implemented */
	return Flash_FunctionNotSupported;
}


/*******************************************************************************
Function:     FlashReadFlagStatusRegister( NMX_uint8 *ucpFlagStatusRegister)    ----ok
Arguments:    ucpFlagStatusRegister, 8-bit buffer to hold the Flag Status Register value read
              from the memory

Return Value:
   Flash_Success

Description:  This function reads the Status Register by sending an
               SPI_FLASH_INS_CLFSR Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially

*******************************************************************************/
ReturnType  FlashClearFlagStatusRegister( void )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashClearFlagStatusRegister\n");
#endif		
		
	CharStream char_stream_send;
	NMX_uint8  cCLFSR = SPI_FLASH_INS_CLFSR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length  = 1;
	char_stream_send.pChar   = &cCLFSR;

	// Step 2: Send the packet serially, get the Status Register content
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}

/*******************************************************************************
Function:     FlashReadNVConfigurationRegister( NMX_uint16 *ucpNVConfigurationRegister)
Arguments:    ucpStatusRegister, 16-bit buffer to hold the Non Volatile Configuration Register
		value read from the memory

Return Value:
   Flash_Success

Description:  This function reads the Non Volatile Configuration Register by sending an
               SPI_FLASH_INS_RDNVCR Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially, get the Configuration Register content

*******************************************************************************/
ReturnType  FlashReadNVConfigurationRegister(NMX_uint16 *ucpNVConfigurationRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashReadNVConfigurationRegister\n");
#endif		
	
	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  cRDNVCR = SPI_FLASH_INS_RDNVCR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length  = 1;
	char_stream_send.pChar   = &cRDNVCR;
	char_stream_recv.length  = 2;
	char_stream_recv.pChar   = (NMX_uint8 *)ucpNVConfigurationRegister;

	// Step 2: Send the packet serially, get the Status Register content
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}

