austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
/*******************************************************************************
Function:     FlashReadVolatileConfigurationRegister( NMX_uint8 *ucpVolatileConfigurationRegister)
Arguments:    ucpVolatileConfigurationRegister, 8-bit buffer to hold the Volatile Configuration Register
		value read from the memory

Return Value:
   Flash_Success

Description:  This function reads the Volatile Register by sending an
               SPI_FLASH_INS_RDVCR Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially, get the Configuration Register content

*******************************************************************************/
ReturnType  FlashReadVolatileConfigurationRegister( NMX_uint8 *ucpVolatileConfigurationRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashReadVolatileConfigurationRegister\n");
#endif		
	
	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  cRDVCR = SPI_FLASH_INS_RDVCR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length  = 1;
	char_stream_send.pChar   = &cRDVCR;
	char_stream_recv.length  = 1;
	char_stream_recv.pChar   = ucpVolatileConfigurationRegister;

	// Step 2: Send the packet serially, get the Volatile Configuration Register content
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}

/*******************************************************************************
Function:     FlashReadVolatileEnhancedConfigurationRegister( NMX_uint8 *ucpVolatileEnhancedConfigurationRegister)
Arguments:    ucpVolatileEnhancedRegister, 8-bit buffer to hold the Volatile Enhanced Configuration Register
		value read from the memory

Return Value:
   Flash_Success

Description:  This function reads the Volatile Enhanced Register by sending an
               SPI_FLASH_INS_RDVECR Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially, get the Configuration Register content

*******************************************************************************/
ReturnType  FlashReadVolatileEnhancedConfigurationRegister( NMX_uint8 *ucpVolatileEnhancedConfigurationRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashReadVolatileEnhancedConfigurationRegister\n");
#endif		
	
	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  cRDVECR = SPI_FLASH_INS_RDVECR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length  = 1;
	char_stream_send.pChar   = &cRDVECR;
	char_stream_recv.length  = 1;
	char_stream_recv.pChar   = ucpVolatileEnhancedConfigurationRegister;

	// Step 2: Send the packet serially, get the Volatile Enhanced Configuration Register content
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}

/*******************************************************************************
Function:     FlashReadFlagStatusRegister( NMX_uint8 *ucp FlagStatusRegister)
Arguments:    ucpStatusRegister, 8-bit buffer to hold the Flag Status Register value read
              from the memory

Return Value:
   Flash_Success

Description:  This function reads the Status Register by sending an
               SPI_FLASH_INS_RFSR Instruction.

Pseudo Code:
   Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
   Step 2: Send the packet serially, get the Status Register content

*******************************************************************************/
ReturnType  FlashReadFlagStatusRegister( NMX_uint8 *ucpFlagStatusRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashReadFlagStatusRegister\n");
#endif		
	
	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  cRFSR = SPI_FLASH_INS_RFSR;

	// Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length  = 1;
	char_stream_send.pChar   = &cRFSR;
	char_stream_recv.length  = 1;
	char_stream_recv.pChar   = ucpFlagStatusRegister;

	// Step 2: Send the packet serially, get the Status Register content
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}

/*******************************************************************************
Function:     FlashWriteVolatileConfigurationRegister( NMX_uint8 ucVolatileConfigurationRegister)
Arguments:    ucVolatileConfigurationRegister, an 8-bit new value to be written to the Volatile Configuration Register

Return Value:
   Flash_Success

Description:  This function modifies the Volatile Configuration Register by sending an
              SPI_FLASH_INS_WRVCR Instruction.
              The Write Volatile Configuration Register (WRVCR) Instruction has effect immediatly

Pseudo Code:
   Step 1: Disable Write protection
   Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
   Step 3: Send the packet serially
   Step 4: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType  FlashWriteVolatileConfigurationRegister( NMX_uint8 ucVolatileConfigurationRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashWriteVolatileConfigurationRegister\n");
#endif		

	
	CharStream char_stream_send;
	NMX_uint8  pIns_Val[2];

	// Step 1: Disable Write protection
	FlashWriteEnable();

	// Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
	char_stream_send.length = 2;
	char_stream_send.pChar  = pIns_Val;
	pIns_Val[0] = SPI_FLASH_INS_WRVCR;
	pIns_Val[1] = ucVolatileConfigurationRegister;

	// Step 3: Send the packet serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

