austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
	//SPI_setXiPMode(ucVolatileConfigurationRegister);

	// Step 4: Wait until the operation completes or a timeout occurs.
	return WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);
}


/*******************************************************************************
Function:     FlashWriteVolatileEnhancedConfigurationRegister( NMX_uint8 ucVolatileEnhancedConfigurationRegister)
Arguments:    ucVolatileConfigurationRegister, an 8-bit new value to be written to the Volatile Enhanced Configuration Register

Return Value:
   Flash_Success

Description:  This function modifies the Volatile Enhanced Configuration Register by sending an
              SPI_FLASH_INS_WRVECR Instruction.
              The Write Volatile Enhanced Configuration Register (WRVECR) Instruction has effect immediatly

Pseudo Code:
   Step 1: Disable Write protection
   Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
   Step 3: Send the packet serially
   Step 5: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType  FlashWriteVolatileEnhancedConfigurationRegister( NMX_uint8 ucVolatileEnhancedConfigurationRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashWriteVolatileEnhancedConfigurationRegister\n");
#endif		
	
	CharStream char_stream_send;
	NMX_uint8  pIns_Val[2];

	// Step 1: Disable Write protection
	FlashWriteEnable();

	// Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
	char_stream_send.length = 2;
	char_stream_send.pChar  = pIns_Val;
	pIns_Val[0] = SPI_FLASH_INS_WRVECR;
	pIns_Val[1] = ucVolatileEnhancedConfigurationRegister;

	// Step 3: Send the packet serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 5: Wait until the operation completes or a timeout occurs.
	return WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);
}

/*******************************************************************************
Function:     FlashWriteNVConfigurationRegister( NMX_uint16 ucNVConfigurationRegister)
Arguments:    ucVolatileConfigurationRegister, an 8-bit new value to be written to the Non Volatile Configuration Register

Return Value:
   Flash_Success

Description:  This function modifies the Non Volatile Configuration Register by sending an
              SPI_FLASH_INS_WRNVCR Instruction.
              The Write Non Volatile Configuration Register (WRVECR) Instruction has effect at the next power-on

Pseudo Code:
   Step 1: Disable Write protection
   Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
   Step 3: Send the packet serially
   Step 4: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType  FlashWriteNVConfigurationRegister( NMX_uint16 ucNVConfigurationRegister)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashWriteNVConfigurationRegister\n");
#endif		
	
	CharStream char_stream_send;
	NMX_uint8  pIns_Val[3];

	// Step 1: Disable Write protection
	FlashWriteEnable();

	// Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
	char_stream_send.length = 3;
	char_stream_send.pChar  = pIns_Val;
	pIns_Val[0] = SPI_FLASH_INS_WRNVCR;
	pIns_Val[1] = (ucNVConfigurationRegister >> 8)& 0xFF;
	pIns_Val[2] = ucNVConfigurationRegister & 0xFF;

	// Step 3: Send the packet serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

	// Step 4: Wait until the operation completes or a timeout occurs.
	return WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);
}


#ifdef VERBOSE
/*******************************************************************************
Function:     FlashErrorStr( ReturnType rErrNum );
Arguments:    rErrNum is the error number returned from other Flash memory Routines

Return Value: A pointer to a string with the error message

Description:  This function is used to generate a text string describing the
   error from the Flash memory. Call with the return value from other Flash memory routines.

Pseudo Code:
   Step 1: Return the correct string.
*******************************************************************************/
NMX_sint8 *FlashErrorStr( ReturnType rErrNum )
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("*FlashErrorStr\n");
#endif		
	
	switch(rErrNum)
	{
	case Flash_AddressInvalid:
		return "Flash - Address is out of Range";
	case Flash_MemoryOverflow:
		return "Flash - Memory Overflows";
	case Flash_PageEraseFailed:
		return "Flash - Page Erase failed";
	case Flash_PageNrInvalid:
		return "Flash - Page Number is out of Range";
	case Flash_SectorNrInvalid:
		return "Flash - Sector Number is out of Range";
	case Flash_FunctionNotSupported:
		return "Flash - Function not supported";
	case Flash_NoInformationAvailable:
		return "Flash - No Additional Information Available";
	case Flash_OperationOngoing:
		return "Flash - Operation ongoing";
	case Flash_OperationTimeOut:
		return "Flash - Operation TimeOut";
	case Flash_ProgramFailed:
		return "Flash - Program failed";
	case Flash_Success:
		return "Flash - Success";
	case Flash_WrongType:
		return "Flash - Wrong Type";
	default:
		return "Flash - Undefined Error Value";
	} /* EndSwitch */
} /* EndFunction FlashErrorString */
#endif /* VERBOSE Definition */


/*******************************************************************************
Function:     FlashTimeOut(NMX_uint32 udSeconds)
Arguments:    udSeconds holds the number of seconds before TimeOut occurs

Return Value:
   Flash_OperationTimeOut
   Flash_OperationOngoing

Example:   FlashTimeOut(0)  // Initializes the Timer

           While(1) {
              ...
              If (FlashTimeOut(5) == Flash_OperationTimeOut) break;
              // The loop is executed for 5 Seconds before the operation is aborted
           } EndWhile

*******************************************************************************/
#ifdef TIME_H_EXISTS
/*-----------------------------------------------------------------------------
Description:   This function provides a timeout for Flash polling actions or
   other operations which would otherwise never return.
   The Routine uses the function clock() inside ANSI C library "time.h".
-----------------------------------------------------------------------------*/
ReturnType FlashTimeOut(NMX_uint32 udSeconds)
{		
	
	static clock_t clkReset,clkCount;

	if (udSeconds == 0)   /* Set Timeout to 0 */
	{
		clkReset=clock();
	} /* EndIf */

	clkCount = clock() - clkReset;

	if (clkCount<(CLOCKS_PER_SEC*(clock_t)udSeconds))
		return Flash_OperationOngoing;
	else
		return Flash_OperationTimeOut;
}/* EndFunction FlashTimeOut */

#else

/*-----------------------------------------------------------------------------
Description:   This function provides a timeout for Flash polling actions or
   other operations which would otherwise never return.
   The Routine uses COUNT_FOR_A_SECOND which is considered to be a loop that
   counts for one second. It needs to be adapted to the target Hardware.
-----------------------------------------------------------------------------*/
ReturnType FlashTimeOut(NMX_uint32 udSeconds)
{

	
	static NMX_uint32 udCounter = 0;
	if (udSeconds == 0)   /* Set Timeout to 0 */
	{
		udCounter = 0;
	} /* EndIf */

	if (udCounter >= (udSeconds * COUNT_FOR_A_SECOND))
	{
		udCounter = 0;
		return Flash_OperationTimeOut;
	}
	else
	{
		udCounter++;
		return Flash_OperationOngoing;
	} /* Endif */

} /* EndFunction FlashTimeOut */

#endif

/*-----------------------------------------------------------------------------
Description:   This function fill the vector in according with address mode
-----------------------------------------------------------------------------*/
void fill_addr_vect(uAddrType udAddr, NMX_uint8* pIns_Addr, NMX_uint8 num_address_byte)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("fill_addr_vect\n");
#endif	
	
	/* 3-addr byte mode */
	if(FLASH_3_BYTE_ADDR_MODE == num_address_byte)
	{
		pIns_Addr[1]              = udAddr>>16;
		pIns_Addr[2]              = udAddr>>8;
		pIns_Addr[3]              = udAddr;
	}

	/* 4-addr byte mode */
	if(FLASH_4_BYTE_ADDR_MODE == num_address_byte)
	{
		pIns_Addr[1]              = udAddr>>24;
		pIns_Addr[2]              = udAddr>>16;
		pIns_Addr[3]              = udAddr>>8;
		pIns_Addr[4]              = udAddr;
	}
	return;
}

/*-----------------------------------------------------------------------------
Description:   This function wait till instruction execution is complete
-----------------------------------------------------------------------------*/
ReturnType WAIT_TILL_Instruction_EXECUTION_COMPLETE(NMX_sint16 second)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("WAIT_TILL_Instruction_EXECUTION_COMPLETE\n");
#endif		
	
