austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
	FlashTimeOut(0);
	while(IsFlashBusy())
	{
		if(Flash_OperationTimeOut == FlashTimeOut(second))
			return  Flash_OperationTimeOut;
	}
	return Flash_Success;
}


/*******************************************************************************
Function:     ReturnType FlashEnter4ByteAddressMode(void)
Arguments:

Return Value:
   Flash_Success

Description:  This function set the 4-byte-address mode

Pseudo Code:
   Step 1: Write enable
   Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
   Step 3: Send the packet serially
   Step 4: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType FlashEnter4ByteAddressMode(void)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashEnter4ByteAddressMode\n");
#endif		
	
	CharStream char_stream_send;
	NMX_uint8 cPER = SPI_FLASH_4B_MODE_ENTER;
	ReturnType ret;
	NMX_uint8 flag;

#ifndef SUPPORT_N25Q_STEP_B
	FlashWriteEnable();
#endif

	char_stream_send.length   = 1;
	char_stream_send.pChar    = &cPER;

	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

#ifdef DEBUG
	NRF_LOG_RAW_INFO("ENTER 4-byte-addr mode\n");
#endif

	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);

	/* verify current addr mode */
	fdo->GenOp.ReadFlagStatusRegister(&flag);
	if (flag & 1)
		fdo->Desc.NumAddrByte = FLASH_4_BYTE_ADDR_MODE;
	else
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

	return ret;
}

/*******************************************************************************
Function:     ReturnType FlashExit4ByteAddressMode(void)
Arguments:

Return Value:
   Flash_Success

Description:  This function unset 4-byte-address mode

Pseudo Code:
   Step 1: Write enable
   Step 2: Initialize the data (i.e. Instruction & value) packet to be sent serially
   Step 3: Send the packet serially
   Step 4: Wait until the operation completes or a timeout occurs.
*******************************************************************************/
ReturnType FlashExit4ByteAddressMode(void)
{
	CharStream char_stream_send;
	NMX_uint8 cPER = SPI_FLASH_4B_MODE_EXIT;
	ReturnType ret;
	NMX_uint8 flag;

#ifndef SUPPORT_N25Q_STEP_B
	FlashWriteEnable();
#endif

	char_stream_send.length   = 1;
	char_stream_send.pChar    = &cPER;

	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

#ifdef DEBUG
	NRF_LOG_RAW_INFO("EXIT 4-byte-addr mode\n");
#endif

	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);

	/* verify current addr mode */
	fdo->GenOp.ReadFlagStatusRegister(&flag);
	if (flag & 1)
		fdo->Desc.NumAddrByte = FLASH_4_BYTE_ADDR_MODE;
	else
		fdo->Desc.NumAddrByte = FLASH_3_BYTE_ADDR_MODE;

	return ret;
}

/*******************************************************************************
Function: FlashLockSector

Arguments: address, len

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashLockSector(uAddrType address,  NMX_uint32 len)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashLockSector\n");
#endif	
	
	NMX_uint8 TB, BP, SR;
	int i, protected_area, start_sector;
	int sector_size, num_of_sectors;

	sector_size = fdo->Desc.FlashSectorSize;
	num_of_sectors = fdo->Desc.FlashSectorCount;

	FlashWriteEnable();

	start_sector = address / sector_size;
	protected_area = len / sector_size;

	if (protected_area == 0 || protected_area > num_of_sectors)
		return Flash_AddressInvalid;

	//(pa & (pa - 1) == 0) verifica che pa sia una potenza di 2
	if ((start_sector != 0 && (start_sector + protected_area) != num_of_sectors) || (protected_area & (protected_area - 1)) != 0)
		return Flash_AddressInvalid;


	if (address/sector_size < num_of_sectors/2)
	{
		TB = 1;
	}
	else
	{
		TB = 0;
	}

	BP = 1;
	for (i = 1; i <= num_of_sectors; i = i*2)
	{
		if (protected_area == i)
		{
			break;
		}
		BP++;
	}

	SR = (((BP & 8) >> 3) << 6) | (TB << 5) | ((BP & 7) << 2);

	FlashWriteStatusRegister(SR);
	return Flash_Success;

}

/*******************************************************************************
Function: FlashUnlockAllSector

Arguments: (none)

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashUnlockAllSector(void)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashUnlockAllSector\n");
#endif	
	
	NMX_uint8 SR = 0;

	/* Set BP2, BP1, BP0 to 0 (all flash sectors unlocked) */
	FlashWriteStatusRegister(SR);

	return Flash_Success;
}
/* End of file */

/*******************************************************************************
Function: FlashOTPProgram

Arguments: *pArray, udNrOfElementsInArray

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashOTPProgram(NMX_uint8 *pArray , NMX_uint32 udNrOfElementsInArray)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashOTPProgram\n");
#endif	

	CharStream char_stream_send;
	NMX_uint8 i;
	NMX_uint8 pIns_Addr[5];
	NMX_uint8 sentBuffer[fdo->Desc.FlashOTPSize+1];
	NMX_uint32 udAddr;
	ReturnType ret;
	UNUSED(sentBuffer);
	
	// Step 1: Validate address input
	if(udNrOfElementsInArray > fdo->Desc.FlashOTPSize)
		return Flash_AddressInvalid;

	/* Address is always 0x000000 */
	udAddr = 0x000000;

	/* Output buffer (with user data within) is fixed to 65 elements */
	for(i=0; i<udNrOfElementsInArray; i++)
		sentBuffer[i] = pArray[i];

	/* Fill the others bytes with 00 */
	for(i=udNrOfElementsInArray; i<fdo->Desc.FlashOTPSize; i++)
		sentBuffer[i] = 0x00;

	/* This is the byte 64, OTP Control byte (if bit 0 = 0 -> OTP Locked) */
	sentBuffer[fdo->Desc.FlashOTPSize] = 0;

	// Step 2: Check whether any previous Write, Program or Erase cycle is on-going
	if(IsFlashBusy())
		return Flash_OperationOngoing;

	// Step 3: Disable Write protection
	fdo->GenOp.WriteEnable();

	// Step 4: Initialize the data (Instruction & address only) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;
	char_stream_send.pChar    = pIns_Addr;

	pIns_Addr[0]              = SPI_FLASH_INS_PROTP;

	/* Always use 3 bytes address and address is 0x000000 */
	fill_addr_vect(udAddr, pIns_Addr, 3);

	// Step 5: Send the packet (Instruction & address only) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsInitTransfer);

	// Step 6: Initialize the data (data to be programmed) packet to be sent serially
	char_stream_send.length   = udNrOfElementsInArray;
	char_stream_send.pChar    = pArray;

	// Step 7: Send the packet (data to be programmed) serially
	Serialize_SPI(&char_stream_send,
	              NULL_PTR,
	              OpsWakeUp,
	              OpsEndTransfer);

