austinawolf/NRF52_SDK_14.3/external/N25Q/N25Q.c
	// Step 8: Wait until the operation completes or a timeout occurs.
	ret = WAIT_TILL_Instruction_EXECUTION_COMPLETE(1);

	return ret;
}

/*******************************************************************************
Function: FlashOTPRead

Arguments: *ucpElements, udNrOfElementsToRead

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashOTPRead(NMX_uint8 *ucpElements, NMX_uint32 udNrOfElementsToRead)
{
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashOTPRead\n");
#endif	

	CharStream char_stream_send;
	CharStream char_stream_recv;
	NMX_uint8  pIns_Addr[5];
	NMX_uint32 udAddr;

	/* Address is always 0x000000 */
	udAddr = 0x000000;

	// Step 2: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;
	char_stream_send.pChar    = pIns_Addr;
	pIns_Addr[0]              = SPI_FLASH_INS_RDOTP;

	fill_addr_vect(udAddr, pIns_Addr, 3);

	char_stream_recv.length   = udNrOfElementsToRead;
	char_stream_recv.pChar    = ucpElements;

	// Step 3: Send the packet serially, and fill the buffer with the data being returned
	Serialize_SPI(&char_stream_send,
	              &char_stream_recv,
	              OpsWakeUp,
	              OpsEndTransfer);

	return Flash_Success;
}

/*******************************************************************************
Function: FlashReadLockRegister

Arguments: uAddrType address,  NMX_uint8 * val

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashReadLockRegister(uAddrType address,  NMX_uint8 * val) 
{

#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashReadLockRegister\n");
#endif	

	CharStream char_stream_send;
    CharStream char_stream_recv;
	NMX_uint8  pIns_Addr[5];

    // Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 1;
    char_stream_send.pChar    = pIns_Addr;
    pIns_Addr[0]              = SPI_FLASH_INS_RDLR;

	fill_addr_vect(address, pIns_Addr, fdo->Desc.NumAddrByte);

    char_stream_recv.length   = 1 ;
    char_stream_recv.pChar    = val;

    // Step 2: Send the packet serially, and fill the buffer with the data being returned
    Serialize_SPI(&char_stream_send,
              &char_stream_recv,
              OpsWakeUp,
              OpsEndTransfer);

    return Flash_Success;
}

/*******************************************************************************
Function: FlashWriteLockRegister

Arguments: uAddrType address,  NMX_uint8 * val

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashWriteLockRegister(uAddrType address,  NMX_uint8 * val) 
{

#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashWriteLockRegister\n");
#endif	


	CharStream char_stream_send;
	NMX_uint8  pIns_Addr[6];

	FlashWriteEnable();

    // Step 1: Initialize the data (i.e. Instruction) packet to be sent serially
	char_stream_send.length   = fdo->Desc.NumAddrByte + 2;
    char_stream_send.pChar    = pIns_Addr;
    pIns_Addr[0]              = SPI_FLASH_INS_CMD_WRLR;

	fill_addr_vect(address, pIns_Addr, fdo->Desc.NumAddrByte);
	pIns_Addr[fdo->Desc.NumAddrByte + 1] = *val;

	
    // Step 2: Send the packet serially, and fill the buffer with the data being returned
    Serialize_SPI(&char_stream_send,
					NULL_PTR,
					OpsWakeUp,
					OpsEndTransfer);


    return Flash_Success;
}

/*******************************************************************************
Function: FlashLockOneSector

Arguments: address

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashLockOneSector(uAddrType address) 
{

#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashLockOneSector\n");
#endif


	NMX_uint8 LR;
	int sector_size;

	sector_size = fdo->Desc.FlashSectorSize;
    // Validate address input
    if(!(address < fdo->Desc.FlashSize))
		return Flash_AddressInvalid;
	//Read LR
	FlashReadLockRegister((address & (~(sector_size-1))),&LR);
	//Check sector write lock bit
	if(LR & 0x01)
		return Flash_Success;
	//Check write lock down bit
	if(LR & 0x02)
		return Flash_SectorLockDownFailed;
	
	LR = 0x01;
	FlashWriteLockRegister((address & (~(sector_size-1))),&LR);

	return Flash_Success;

}

/*******************************************************************************
Function: FlashUnlockOneSector

Arguments: address

Return Values: ReturnType

Description:

Note:

Pseudo Code:

*******************************************************************************/
ReturnType FlashUnlockOneSector(uAddrType address)
{
	
#ifdef PRINT_FUNCTION_CALL
	NRF_LOG_RAW_INFO("FlashUnlockOneSector\n");
#endif

	NMX_uint8 LR;
	int sector_size;

	sector_size = fdo->Desc.FlashSectorSize;
    // Validate address input
    if(!(address < fdo->Desc.FlashSize))
		return Flash_AddressInvalid;
	//Read LR
	FlashReadLockRegister((address & (~(sector_size-1))),&LR);
	//Check sector write lock bit
	if(!(LR & 0x01))
		return Flash_Success;
	//Check write down lock bit
	if(LR & 0x02)
		return Flash_SectorLockDownFailed;
	
	LR = 0x00;
	FlashWriteLockRegister((address & (~(sector_size-1))),&LR);

	return Flash_Success;

}
